#### terraform plan every: 330b912
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.cert.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/edf0ecd3-c69b-4885-86d3-e74747cf8f50]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b9c9dcab97f3491c]
module.cert.aws_route53_record.validations["line-bot-sample2.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME]
module.cert.aws_acm_certificate_validation.main: Refreshing state... [id=2021-05-13 15:20:13 +0000 UTC]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/line-bot-sample2-target-group/70b26b2b5f86c8c8]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-018065a63b6130bfe]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-04804371ae1f9809c]
module.security.aws_security_group.alb: Refreshing state... [id=sg-04beec5e23013d0e1]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-03f4cbdd4a64f5fcc]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-021f551afe825eaf4]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-0ed49c51b0489582d]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0b70868bcea2c3341]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0beef6d228bbee9f3]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-098990c41659b271d]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-011fc3784f91a04dd]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-059083d65d7027ce5]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-03f53d9a3c862584d]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/line-bot-sample2/a5d1dba69ee938c5]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-003ee8777d7762859]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0c55a085fa8ce5c18]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0fb02245b5bb0f9d0]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-03f53d9a3c862584d1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01e002c6c4db2d57d]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07c382b8af7cf8583]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-06a570762ce0bf912]
module.alb.aws_lb_listener.http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/a5d1dba69ee938c5/c3af6fbcd9dae421]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/a5d1dba69ee938c5/5b14388e7bb04224]
module.route53.aws_route53_record.main: Refreshing state... [id=Z04052072YGY8CIREK2A2_line-bot-sample2.moikilo00.net_A]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener-rule/app/line-bot-sample2/a5d1dba69ee938c5/5b14388e7bb04224/2c0ba6699ffd1f3e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "line-bot-sample2-app"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.vpc_endpoint.aws_security_group.vpc_endpoint will be created
  + resource "aws_security_group" "vpc_endpoint" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "vpc_endpoint_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

  # module.vpc_endpoint.aws_vpc_endpoint.cloudwatch_logs will be created
  + resource "aws_vpc_endpoint" "cloudwatch_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-021f551afe825eaf4",
          + "subnet-0b70868bcea2c3341",
          + "subnet-0ed49c51b0489582d",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b9c9dcab97f3491c"
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-021f551afe825eaf4",
          + "subnet-0b70868bcea2c3341",
          + "subnet-0ed49c51b0489582d",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b9c9dcab97f3491c"
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-021f551afe825eaf4",
          + "subnet-0b70868bcea2c3341",
          + "subnet-0ed49c51b0489582d",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b9c9dcab97f3491c"
    }

  # module.vpc_endpoint.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-0b9c9dcab97f3491c"
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ssm will be created
  + resource "aws_vpc_endpoint" "ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-021f551afe825eaf4",
          + "subnet-0b70868bcea2c3341",
          + "subnet-0ed49c51b0489582d",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b9c9dcab97f3491c"
    }

  # module.vpc_endpoint.aws_vpc_endpoint_route_table_association.private_s3[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = "rtb-011fc3784f91a04dd"
      + vpc_endpoint_id = (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint_route_table_association.private_s3[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = "rtb-0beef6d228bbee9f3"
      + vpc_endpoint_id = (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint_route_table_association.private_s3[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = "rtb-098990c41659b271d"
      + vpc_endpoint_id = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "ecr_name" but a value was
found in file "dev.auto.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*